&НаКлиенте
Процедура ver(Команда)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	СисИнфо = Новый СистемнаяИнформация;
	Текст = Новый ЗаписьТекста("info.txt", КодировкаТекста.ANSI);
	Текст.ЗаписатьСтроку("plat_vers=" + СисИнфо.ВерсияПриложения);
	Текст.ЗаписатьСтроку("conf_name="+Метаданные.Синоним);
	Текст.ЗаписатьСтроку("conf_vers="+Метаданные.Версия);
	Текст.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	ЗавершитьРаботуСистемы(ЛОЖЬ)
КонецПроцедуры
